ScaleDIN/electroNIX-ESP32/electroNIX/display_testa.cpp
// ============================================================================
//  display_testa.cpp — TESTA-QUADRA boards converted to ESP32
//
//  Covers five boards that share an electrical design:
//    electroNIX 4+S 6 x IN-12, IRLR3110Z, no backlight; seconds tubes added
//                   to the electroNIX 4, both colon positions wired in parallel
//    electroNIX 4   PCB-061, 2014, 4 x LC-513/531, IRLR3110Z boost switch
//    electroNIX 3   PCB-036, 2013, 4 x ZM1080T, single colon neon, IRLR3110Z
//    electroNIX 2   PCB-030/031, 2013, 4 x Z566M + 2 x ZM1080T, LED backlight
//    fourTINY       rev 11-11-2013, 4 x LC-516
//
//  All four drive ten cathodes and N anodes from discrete NPN switches behind
//  33 k base resistors, regulate a 170 V boost converter in software from a
//  430 k / 6.2 k feedback divider, and read ambient light from a phototransistor
//  on a 1 M pull-up. See WIRING.md for tap points and the gate-driver
//  requirement on the two boards fitted with an IRF840.
//
//  Colon behaviour: SEC_0/SEC_1 are driven by hardware PWM (see "Neon colon
//  dimming" below) rather than a plain digitalWrite, so they cross-fade
//  smoothly and BREATHE is a real breath rather than degrading to a blink.
//  Whenever core_timeTrusted() is false, SEC_1 is taken over as a dedicated
//  "don't trust this time" indicator and blinks at 1 Hz regardless of the
//  configured mode; SEC_0 is forced off so the warning reads as a distinct
//  state rather than blending into whatever the colon was already doing.
//
//  electroNIX 3 ships with only one colon neon (SEC_0) from the factory --
//  there's no SEC_1 net on that schematic at all -- but the firmware still
//  supports a second one, wired as a bodge (see WIRING.md): PIN_NEON1 = 5,
//  same convention as electroNIX 4 and fourTINY. Whether it's actually there
//  is a runtime choice, cfg.neon1Fitted, exposed in the web UI only on
//  boards where board.h's BOARD_NEON1_OPTIONAL says it's genuinely a
//  per-unit question rather than a fixed hardware fact. applyColon() below
//  is one function that branches on that flag: with SEC_1 available, the
//  usual two-lamp behaviour; without it, SEC_0 does double duty, rendering
//  the configured colon mode most of the time and switching over to the
//  warning blink pattern instead of it being silently invisible. ALTERNATE
//  has nothing to alternate with on one lamp, so it falls back to STEADY.
//
//  That warning blinks from power-on, not just once NTP has had a chance to
//  fail: applyColon() runs from fadeTask, a FreeRTOS task started in
//  display_init(), so it keeps ticking during the up-to-20-second blocking
//  WiFi connection attempt in core_setup() -- core_loop() (and with it, the
//  core's own 100 ms tick) doesn't start until that returns. effBright and
//  hvEnable both start non-zero/true rather than their usual 0/false for the
//  same reason: hvTask is likewise independent of the core, and the neons
//  run off the same 170 V rail as the tubes, so without HV already coming up
//  the warning would have nothing to strike against. One small side effect:
//  on a reboot that happens to land inside a configured night-mode window,
//  the colon may briefly light before the core's first real
//  display_setBrightness() call corrects it a few seconds later.
// ============================================================================
#include "board.h"
#if BOARD == BOARD_ELECTRONIX_4 || BOARD == BOARD_ELECTRONIX_3 || BOARD == BOARD_ELECTRONIX_2 || BOARD == BOARD_ELECTRONIX_4_6T

#include "display.h"
#include "clock_core.h"

#if __has_include(<hal/gpio_ll.h>)
  #include <hal/gpio_ll.h>
#endif
#include <soc/gpio_struct.h>

// ---- Pin maps --------------------------------------------------------------
#if BOARD == BOARD_ELECTRONIX_2
  // Retrofit: SEC_1 lifted from GPIO3 and rewired to GPIO0 (10 kΩ pull-up
  // to 3V3 required on GPIO0 -- same strapping-pin rule as GPIO0/GPIO15 on
  // the 6-tube boards); GPIO1 disconnected from the backlight chain. This
  // frees GPIO1 and GPIO3 for DS3231 I2C, making all TESTA boards identical.
  // To revert to the original wiring (backlight + original colon GPIOs):
  //   PIN_NEON1 = 3, PIN_LEDBL = 1, set BOARD_HAS_LED_BL 1 in board.h.
  static const uint8_t ANODE_PINS[BOARD_TUBES] = {16, 17, 18, 19, 33, 5};
  static const uint8_t CATHODE_PINS[10] = {13, 14, 15, 21, 22, 23, 25, 26, 27, 32};
  static const uint8_t PIN_NEON0 = 4;   // SEC_0, HH:MM colon (unchanged)
  static const uint8_t PIN_NEON1 = 0;   // SEC_1, MM:SS colon — moved to GPIO0
#elif BOARD == BOARD_ELECTRONIX_2USB || BOARD == BOARD_ELECTRONIX_4_6T
  // Six-tube expansion boards with no backlight.  GPIO0 and GPIO15 (the two
  // strapping pins not already in use) become anodes W_5 and W_6.  The UART
  // pins GPIO1 and GPIO3 are then free for I2C, giving the DS3231 RTC the same
  // SDA/SCL assignment as the 4-tube boards and a single module wiring that
  // works across the whole family.
  //
  // Boot-safety pull-ups (≥10 kΩ to 3V3) are REQUIRED on GPIO0 and GPIO15:
  // the 33 kΩ base resistor loads those pins enough that the ESP32's internal
  // pull-up alone cannot guarantee a clean HIGH for the strapping sampler at
  // reset.  See WIRING.md — Shared notes — for the value calculation.
  //
  // GPIO1 (TX) is still driven by the bootloader at reset; this now goes to
  // the I2C SDA line rather than an anode, where it produces a harmless
  // bus glitch before Wire.begin() is called.
  static const uint8_t ANODE_PINS[BOARD_TUBES] = {16, 17, 18, 19, 0, 15};
  static const uint8_t CATHODE_PINS[10] = {13, 14, 21, 22, 23, 25, 26, 27, 32, 33};
  static const uint8_t PIN_NEON0 = 4;   // SEC_0, unchanged from 4-tube boards
  static const uint8_t PIN_NEON1 = 5;   // SEC_1, unchanged from 4-tube boards
#else
  // Four-tube boards: electroNIX 4 and electroNIX 3.
  // fourTINY users should select BOARD_ELECTRONIX_4 — the pin maps are
  // identical; only the IRF840 boost FET differs (fit a gate driver or a
  // logic-level replacement, then the same firmware applies).
  // Serial is disabled on all builds (BOARD_USE_SERIAL 0); GPIO1 and GPIO3
  // are free for the optional DS3231 RTC module (I2C SDA and SCL).
  static const uint8_t ANODE_PINS[BOARD_TUBES] = {16, 17, 18, 19};
  static const uint8_t CATHODE_PINS[10] = {13, 14, 21, 22, 23, 25, 26, 27, 32, 33};
  static const uint8_t PIN_NEON0 = 4;
  static const uint8_t PIN_NEON1 = 5;   // stock electroNIX 3 has no SEC_1 net --
                                          // this is where to land the bodge if
                                          // you add one (see WIRING.md). Driving
                                          // an unpopulated pin is harmless.
#endif
static const uint8_t PIN_HV_PWM   = 2;     // boot pull-down keeps the FET off
static const uint8_t PIN_BUZZER   = 12;    // MEL; strapping pin, held low by R
static const uint8_t PIN_HV_SENSE = 35;    // KOMP_170V
static const uint8_t PIN_LIGHT    = 34;    // JASNOSC

// ---- HV regulation ---------------------------------------------------------
static const float    HV_DIV_RATIO = (430.0f + 6.2f) / 6.2f;   // 70.35 on all three
static const uint32_t HV_PWM_FREQ  = 32000;   // matches the original AVR firmware
static const uint8_t  HV_PWM_RES   = 10;
static const uint32_t HV_DUTY_MAX  = 420;     // ~41 % absolute clamp
static const float    HV_OV_CUT    = 12.0f;

