ScaleDIN/electroNIX-ESP32/electroNIX/display_testa.cpp
// ---- Neon colon dimming -----------------------------------------------------
// Neon indicator lamps are cold-cathode glow-discharge devices -- the same
// family as the nixie tubes themselves, just tiny and run at a fraction of
// the current (the schematics spec ~0.3 mA through the 430 k series
// resistor, against a couple of mA for a lit digit). The nixie multiplex
// already proves the underlying idea works: strike at a fixed current,
// vary the fraction of time spent lit, and 100 Hz-plus is fast enough that
// nobody sees the individual strikes. This applies the same principle to
// the colon neons via the ESP32's hardware PWM instead of digitalWrite.
//
// Two things are different from the nixie tubes, though, and both are
// engineering judgement rather than anything measured on real hardware:
//  - 1 kHz (matching the LED backlight's PWM) rather than the nixie
//    multiplex's ~100 Hz frame, to keep comfortably clear of flicker with
//    margin to spare, since a bare glow-discharge lamp has no phosphor
//    persistence to smooth out any judder the way an LED or nixie digit
//    would.
//  - A hard floor on the minimum duty cycle (NEON_PWM_FLOOR). At 0.3 mA
//    already, cutting the average current further via a very short pulse
//    risks the lamp not making it through a full ionise/sustain/deionise
//    cycle before the next strike, which would show up as flicker at the
//    low end rather than a smooth fade to dark. The floor below trades a
//    small jump right at "just lit" for avoiding that.
// If dimming looks uneven or flickery on your board, NEON_PWM_FREQ and
// NEON_PWM_FLOOR are the two constants to retune -- there's no datasheet
// figure for these specific lamps to derive them from.
static const uint32_t NEON_PWM_FREQ  = 1000;
static const uint8_t  NEON_PWM_RES   = 8;     // 0..255
static const uint8_t  NEON_PWM_FLOOR = 18;    // ~7 %, the lowest "on" duty used

// ---- Multiplex timing ------------------------------------------------------
static const uint32_t TICK_US    = 25;
static const uint32_t FRAME_US   = 10000;                       // 100 Hz
static const uint8_t  SLOT_TICKS = FRAME_US / (BOARD_TUBES * TICK_US);
static const uint8_t  ACTIVE_TICKS = SLOT_TICKS - 1;
static const uint8_t  BLANK      = 15;

// ---- ISR state -------------------------------------------------------------
static volatile DRAM_ATTR uint32_t tubeWord[BOARD_TUBES];
static volatile DRAM_ATTR uint8_t  vOnTicks[BOARD_TUBES];
static volatile DRAM_ATTR bool     muxHold = false;
static volatile DRAM_ATTR uint8_t  isrCurCath = 255;
static volatile DRAM_ATTR uint32_t muxTicks = 0;
static DRAM_ATTR uint32_t cathM0[11], cathM1[11];
static DRAM_ATTR uint32_t allCathM0 = 0, allCathM1 = 0;
static DRAM_ATTR uint32_t anodeM0[BOARD_TUBES], anodeM1[BOARD_TUBES];
static DRAM_ATTR uint32_t allAnodeM0 = 0, allAnodeM1 = 0;
static hw_timer_t *muxTimer = nullptr;

static uint8_t shOld[BOARD_TUBES], shNew[BOARD_TUBES], shFade[BOARD_TUBES];
static inline void pushTube(int i) {
  tubeWord[i] = ((uint32_t)shFade[i] << 16) | ((uint32_t)shNew[i] << 8) | shOld[i];
}

// ---- Multiplex ISR ---------------------------------------------------------
// Lock-free: each tube's state is one 32-bit word, stored atomically, so no
// spinlock is needed and nothing in loop() can mask this interrupt.
void IRAM_ATTR onMuxTick() {
  static uint8_t slot = 0, tick = 0;
  uint8_t curCath = isrCurCath;
  muxTicks++;

  if (++tick >= SLOT_TICKS) { tick = 0; if (++slot >= BOARD_TUBES) slot = 0; }

  if (muxHold) {
    GPIO.out_w1tc      = allCathM0 | allAnodeM0;
    GPIO.out1_w1tc.val = allCathM1 | allAnodeM1;
    isrCurCath = 255;
    return;
  }

  if (tick == 0) {                            // dead-time between tubes
    GPIO.out_w1tc      = allCathM0 | allAnodeM0;
    GPIO.out1_w1tc.val = allCathM1 | allAnodeM1;
    isrCurCath = 255;
    return;
  }

  uint8_t on = vOnTicks[slot];
  if (tick > on) {                            // brightness blanking
    if (tick == (uint8_t)(on + 1)) {
      GPIO.out_w1tc      = allCathM0 | allAnodeM0;
      GPIO.out1_w1tc.val = allCathM1 | allAnodeM1;
      isrCurCath = 255;
    }
    return;
  }

  uint32_t w = tubeWord[slot];
  uint8_t oldD = (uint8_t)w, newD = (uint8_t)(w >> 8), fade = (uint8_t)(w >> 16);
  uint8_t newTicks = (uint8_t)(((uint16_t)on * fade + 127) / 255);
  uint8_t d = (tick <= (uint8_t)(on - newTicks)) ? oldD : newD;
  if (d > 9) d = 10;

  if (d != curCath) {
    GPIO.out_w1tc      = allCathM0;
    GPIO.out1_w1tc.val = allCathM1;
    GPIO.out_w1ts      = cathM0[d];
    GPIO.out1_w1ts.val = cathM1[d];
    isrCurCath = d;
  }
  if (d <= 9) { GPIO.out_w1ts = anodeM0[slot]; GPIO.out1_w1ts.val = anodeM1[slot]; }
  else        { GPIO.out_w1tc = anodeM0[slot]; GPIO.out1_w1tc.val = anodeM1[slot]; }
}

// ---- Core 2.x / 3.x shims --------------------------------------------------
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
static void hvPwmSetup()          { ledcAttach(PIN_HV_PWM, HV_PWM_FREQ, HV_PWM_RES); }
static void hvPwmRaw(uint32_t d)  { ledcWrite(PIN_HV_PWM, d); }
static void neonPwmSetup() {
  ledcAttach(PIN_NEON0, NEON_PWM_FREQ, NEON_PWM_RES);
  ledcAttach(PIN_NEON1, NEON_PWM_FREQ, NEON_PWM_RES);
}
static void neonPwmWrite(uint8_t which, uint32_t duty) {
  ledcWrite(which ? PIN_NEON1 : PIN_NEON0, duty);
}
#if BOARD_HAS_LED_BL
static void blPwmSetup()          { ledcAttach(PIN_LEDBL, 1000, 8); }
static void blPwmWrite(uint32_t d){ ledcWrite(PIN_LEDBL, d); }
#endif
static void muxTimerSetup() {
  muxTimer = timerBegin(1000000);
  timerAttachInterrupt(muxTimer, &onMuxTick);
  timerAlarm(muxTimer, TICK_US, true, 0);
}
#else
static void hvPwmSetup()          { ledcSetup(0, HV_PWM_FREQ, HV_PWM_RES); ledcAttachPin(PIN_HV_PWM, 0); }
static void hvPwmRaw(uint32_t d)  { ledcWrite(0, d); }
// Channels 0 and 2 are already taken by the HV gate and (where fitted) the
// LED backlight; the neons get 3 and 4.
static void neonPwmSetup() {
  ledcSetup(3, NEON_PWM_FREQ, NEON_PWM_RES); ledcAttachPin(PIN_NEON0, 3);
  ledcSetup(4, NEON_PWM_FREQ, NEON_PWM_RES); ledcAttachPin(PIN_NEON1, 4);
}
static void neonPwmWrite(uint8_t which, uint32_t duty) { ledcWrite(which ? 4 : 3, duty); }
#if BOARD_HAS_LED_BL
static void blPwmSetup()          { ledcSetup(2, 1000, 8); ledcAttachPin(PIN_LEDBL, 2); }
static void blPwmWrite(uint32_t d){ ledcWrite(2, d); }
#endif
static void muxTimerSetup() {
  muxTimer = timerBegin(0, 80, true);
  timerAttachInterrupt(muxTimer, &onMuxTick, true);
  timerAlarmWrite(muxTimer, TICK_US, true);
  timerAlarmEnable(muxTimer);
}
#endif

// Maps a 0..1 brightness fraction onto a PWM duty, with the sustain floor
// described above. 0 stays genuinely 0 (lamp fully off); anything above 0
// jumps to at least NEON_PWM_FLOOR rather than fading smoothly through it.
static uint32_t neonDuty(float k) {
  if (k <= 0.0f) return 0;
  if (k >= 1.0f) return (1UL << NEON_PWM_RES) - 1;
  const uint32_t full = (1UL << NEON_PWM_RES) - 1;
  // Ramp linearly through the floor region (k ~0..7%) rather than jumping
  // to NEON_PWM_FLOOR immediately.  The lamp extinguishes naturally as its
  // duty falls through the sustain threshold during a fade-off, giving a
  // smooth dim-out instead of the previous abrupt cut.  Any flicker in the
  // threshold-crossing window is transient and far less jarring than a hard
  // snap to dark.  Above the floor fraction the mapping is unchanged.
  const float floorFrac = NEON_PWM_FLOOR / (float)full;
  if (k < floorFrac)
    return (uint32_t)(k / floorFrac * NEON_PWM_FLOOR);
  return NEON_PWM_FLOOR +
         (uint32_t)((k - floorFrac) / (1.0f - floorFrac) * (full - NEON_PWM_FLOOR));
}

static inline void hvPwmWrite(uint32_t duty) {
#if HV_PWM_INVERT
  hvPwmRaw(((1UL << HV_PWM_RES) - 1) - duty);
#else
  hvPwmRaw(duty);
#endif
}

// ---- HV regulator ----------------------------------------------------------
// hvEnable starts true on purpose, for the same reason effBright starts
// non-zero (see the comment above fadeTask): hvTask already runs
// independently from display_init(), well before the core calls
// display_setBrightness() with a real target. The neons run off this same
// 170 V rail, so without this the boot-time colon warning would be
// commanding PWM into a lamp with no high voltage behind it yet -- visibly
// nothing, regardless of what applyColon() computes. The very first real
// display_setBrightness() call (whether that's after a normal WiFi connect
// or after falling back to the setup AP) immediately overrides this to
// whatever brightness/night-mode policy actually applies, so this only
// affects the first few seconds of boot.
static volatile bool  hvEnable = true, hvFault = false;
static volatile float hvVolts = 0, hvDutyPct = 0;
static volatile uint32_t hvCuts = 0;

// Trimmed mean of four samples. The SAR ADC throws occasional wild readings
// and the 70:1 divider turns one outlier into tens of volts.
static float readHv() {
  float a[4];
  for (int i = 0; i < 4; i++) a[i] = analogReadMilliVolts(PIN_HV_SENSE);
  for (int i = 1; i < 4; i++)
    for (int j = i; j > 0 && a[j] < a[j-1]; j--) { float t=a[j]; a[j]=a[j-1]; a[j-1]=t; }
  return (a[1] + a[2]) * 0.5f * 0.001f * HV_DIV_RATIO * cfg.hvTrim;
}

