ScaleDIN/electroNIX-ESP32/electroNIX/display_testa.cpp
static void hvTask(void *) {
  uint32_t duty = 0;
  uint16_t faultCnt = 0;
  uint8_t  ovCnt = 0;
  for (;;) {
    float v = readHv();
    hvVolts = v;
    float target = (float)cfg.hvSet;
    float err = target - v;

    if (!hvEnable || hvFault) { duty = 0; ovCnt = 0; }
    else if (v > target + HV_OV_CUT) {
      // Require persistence before acting, and back off rather than to zero,
      // so a glitch is a brief dip instead of a half-second fade back up.
      if (++ovCnt >= 3) { duty = (duty * 7) / 10; ovCnt = 0; hvCuts++; }
    } else {
      ovCnt = 0;
      if      (err >  25.0f) duty += 4;
      else if (err >   2.0f) duty += 1;
      else if (err < -25.0f) duty = (duty > 4) ? duty - 4 : 0;
      else if (err <  -2.0f) duty = (duty > 1) ? duty - 1 : 0;
      if (duty > HV_DUTY_MAX) duty = HV_DUTY_MAX;
    }

    // Near-max duty with no voltage means the divider or converter is open;
    // shut down rather than run open-loop.
    if (duty >= HV_DUTY_MAX && v < 40.0f) {
      if (++faultCnt > 500) { hvFault = true; duty = 0; }
    } else faultCnt = 0;

    hvDutyPct = 100.0f * duty / ((1 << HV_PWM_RES) - 1);
    hvPwmWrite(duty);
    vTaskDelay(pdMS_TO_TICKS(2));
  }
}

// ---- Light sensor ----------------------------------------------------------
static float    lightMv = 2000;
static uint16_t lightPP = 0;

// The sensor sits behind a 1 M pull-up, far above what the SAR ADC likes, so
// oversample and discard the extremes. The raw spread is reported so the web
// UI can show how much noise is arriving.
static float readLight() {
  float a[16];
  for (int i = 0; i < 16; i++) a[i] = analogReadMilliVolts(PIN_LIGHT);
  for (int i = 1; i < 16; i++)
    for (int j = i; j > 0 && a[j] < a[j-1]; j--) { float t=a[j]; a[j]=a[j-1]; a[j-1]=t; }
  lightPP = (uint16_t)(a[15] - a[0]);
  float sum = 0;
  for (int i = 4; i < 12; i++) sum += a[i];
  return sum / 8.0f;
}

// ---- Colon neons -----------------------------------------------------------
static ColonMode colonMode = COLON_BLINK;
static bool colon0On = false, colon1On = false;
// Starts non-zero on purpose: applyColon() runs from fadeTask from the
// moment display_init() returns, well before the core has connected to
// WiFi and called display_setBrightness() with a real target (connectWiFi()
// blocks setup() for up to 20 s). Without this, the "time not trusted"
// warning -- and the colon generally -- would render at 0% and be
// invisible for that whole window instead of showing the clock is alive.
static uint8_t effBright = 60;

// Whether SEC_1 exists on this board at all (a hardware fact, board.h) is
// separate from whether it's actually wired up on this particular unit (a
// runtime choice, cfg.neon1Fitted -- see the comment on that field). This
// function branches on the second, guarded by the first, so a board with no
// PIN_NEON1 in its pin map at all can't be told at runtime to drive one.
static void applyColon() {
  if (muxHold) return;   // display parked (OTA, flash write, wiring rebuild)
  bool even = core_secondIsEven();
  uint16_t ms = core_msIntoSecond();

  // Ease across the second boundary instead of snapping, the same idea as
  // the digit cross-fade and the Nick2's colon dots -- capped well inside a
  // second so it always settles before the next tick regardless of what
  // cfg.fadeMs is set to (that setting is really about the nixie digits).
  uint16_t fMs = cfg.fadeMs; if (fMs == 0) fMs = 1; if (fMs > 900) fMs = 900;
  float p = (float)ms / fMs; if (p > 1.0f) p = 1.0f;
  // Gentler than the WS2812 colon's cubic curve: these lamps have far less
  // usable dimming range, so spending less of it right at the low end
  // leaves more of the fade actually visible rather than compressed near
  // full brightness.
  auto gamma = [](float x) { return x * x; };
  float g_on = gamma(p), g_off = gamma(1.0f - p);

  bool dual = BOARD_DUAL_NEON && cfg.neon1Fitted;

  float a = 0, b = 0;
  if (effBright > 0) {
    if (dual) {
      switch (colonMode) {
        case COLON_OFF:                                   break;
        case COLON_CENTERGLOW:  // no independent centre LED on neon boards
        case COLON_STEADY:    a = b = 1.0f;               break;
        case COLON_BLINK:     a = b = even ? g_on : g_off;   break;
        case COLON_ALTERNATE: a = even ? g_on : g_off;
                              b = even ? g_off : g_on;        break;
        case COLON_BREATHE: {
          // One full breath every two seconds, smoothly eased by the cosine.
          // k is used directly here (no gamma()) because eGamma in the master
          // below already applies the perceptual correction; squaring k on top
          // of that (as gamma(k) would do) compresses the low end so hard that
          // the breathe minimum drops below the lamp's sustain threshold and
          // it extinguishes -- which looks identical to blink.
          float t = (ms / 1000.0f + (even ? 0.0f : 1.0f)) * 0.5f;
          float k = 0.15f + 0.85f * (0.5f - 0.5f * cosf(t * 6.283185f));
          a = b = k;
          break;
        }
      }
      // SEC_1 is dedicated to the "don't trust this time" warning when the
      // time isn't trusted; SEC_0 is forced off so it reads as a distinct
      // state rather than blending into whatever the colon was doing.
      if (!core_timeTrusted()) { b = even ? g_on : g_off; a = 0.0f; }
    } else {
      // One lamp only -- SEC_0 does double duty. ALTERNATE has nothing to
      // alternate with, so it falls back to STEADY.
      switch (colonMode) {
        case COLON_OFF:                                 break;
        case COLON_CENTERGLOW:  // no independent centre LED on neon boards
        case COLON_STEADY:
        case COLON_ALTERNATE: a = 1.0f;                 break;
        case COLON_BLINK:     a = even ? g_on : g_off;  break;
        case COLON_BREATHE: {
          float t = (ms / 1000.0f + (even ? 0.0f : 1.0f)) * 0.5f;
          float k = 0.15f + 0.85f * (0.5f - 0.5f * cosf(t * 6.283185f));
          a = k;   // no gamma() — see dual branch above
          break;
        }
      }
      if (!core_timeTrusted()) a = even ? g_on : g_off;   // takes over the one lamp
    }
  }

  // Apply the same perceptual gamma as display_setBrightness() uses for the
  // nixie tubes (g = effBright² / 10000), so the colon tracks the perceived
  // tube brightness rather than the raw linear percentage.  Without this,
  // the tubes dim quadratically at low effBright (night mode, manual low
  // setting) while the colon only dims linearly, leaving it visibly brighter
  // than the tubes -- most noticeable in night mode.
  //
  // colonBrNeon is then applied on top of that corrected level, so the
  // slider still lets the user set the colon relative to the tubes as
  // intended: 50 means "half as bright as the tubes", at any brightness.
  //
  // 0 → treated as 100 for backward compat (see clock_core.h comment).
  float eGamma = (effBright / 100.0f) * (effBright / 100.0f);
  uint8_t cnBr = cfg.colonBrNeon ? cfg.colonBrNeon : 100;
  float master = eGamma * (cnBr / 100.0f);
  a *= master; b *= master;

  colon0On = a > 0.02f;   // simple on/off for the web preview and getStatus
  colon1On = dual && (b > 0.02f);
  neonPwmWrite(0, neonDuty(a));
  neonPwmWrite(1, neonDuty(b));   // b is already 0 when !dual -- harmless either way
}

