ScaleDIN/electroNIX-ESP32/electroNIX/display_testa.cpp
// ---- Buzzer ----------------------------------------------------------------
#if BOARD_HAS_BUZZER
static uint8_t  beepLeft = 0;
static uint16_t beepOn = 60, beepOff = 120;
static uint32_t beepNext = 0;
static bool     beepState = false;

void display_beep(uint8_t count, uint16_t onMs, uint16_t offMs) {
  beepLeft = count; beepOn = onMs; beepOff = offMs;
  beepState = false; beepNext = millis();
}

static void serviceBeeper() {
  if (!beepLeft && !beepState) return;
  uint32_t now = millis();
  if ((int32_t)(now - beepNext) < 0) return;
  if (!beepState && beepLeft) {
    digitalWrite(PIN_BUZZER, HIGH); beepState = true; beepNext = now + beepOn;
  } else if (beepState) {
    digitalWrite(PIN_BUZZER, LOW); beepState = false; beepLeft--;
    beepNext = now + beepOff;
  }
}
#endif

// ---- Fade timeline (owned by this back-end) --------------------------------
// This task also drives the colon (applyColon, below) rather than leaving
// that to display_tick_100ms(). The core only calls display_tick_100ms()
// from its own loop, which doesn't run at all for the first several seconds
// of boot -- connectWiFi() blocks setup() for up to 20 s before core_loop()
// ever starts. A task started here in display_init() runs the whole time,
// which is what lets the "time not trusted" warning (see applyColon) blink
// from power-on instead of the colon sitting dark while WiFi connects.
static volatile uint16_t fadeDurMs = 0;
static volatile uint32_t fadeStartMs = 0;

static void fadeTask(void *) {
  for (;;) {
    if (fadeDurMs) {
      uint32_t el = millis() - fadeStartMs;
      uint16_t dur = fadeDurMs;
      uint8_t p = (el >= dur) ? 255 : (uint8_t)((el * 255UL) / dur);
      for (int i = 0; i < BOARD_TUBES; i++) {
        if (shOld[i] == shNew[i]) continue;
        shFade[i] = p;
        if (p == 255) shOld[i] = shNew[i];
        pushTube(i);
      }
      if (p == 255) fadeDurMs = 0;
    }
    applyColon();
#if BOARD_HAS_BUZZER
    serviceBeeper();
#endif
    vTaskDelay(pdMS_TO_TICKS(10));
  }
}

// ---- Wiring order ----------------------------------------------------------
// cfg.cathOrder[d] selects which wired cathode lights digit d; cfg.anodeOrder
// does the same for tube positions. Rebuilt live when the user saves.
static void buildMasks() {
  muxHold = true;
  delayMicroseconds(TICK_US * 2);
  GPIO.out_w1tc      = allCathM0 | allAnodeM0;
  GPIO.out1_w1tc.val = allCathM1 | allAnodeM1;
  allCathM0 = allCathM1 = allAnodeM0 = allAnodeM1 = 0;
  isrCurCath = 255;

  for (int d = 0; d < 10; d++) {
    uint8_t idx = (cfg.cathOrder[d] < 10) ? cfg.cathOrder[d] : d;
    uint8_t pin = CATHODE_PINS[idx];
    cathM0[d] = (pin < 32) ? (1UL << pin) : 0;
    cathM1[d] = (pin < 32) ? 0 : (1UL << (pin - 32));
    allCathM0 |= cathM0[d]; allCathM1 |= cathM1[d];
  }
  cathM0[10] = cathM1[10] = 0;                        // blank entry

  for (int i = 0; i < BOARD_TUBES; i++) {
    uint8_t idx = (cfg.anodeOrder[i] < BOARD_TUBES) ? cfg.anodeOrder[i] : i;
    uint8_t pin = ANODE_PINS[idx];
    anodeM0[i] = (pin < 32) ? (1UL << pin) : 0;
    anodeM1[i] = (pin < 32) ? 0 : (1UL << (pin - 32));
    allAnodeM0 |= anodeM0[i]; allAnodeM1 |= anodeM1[i];
  }
  muxHold = false;
}

// ============================================================================
//  Interface
// ============================================================================
void display_init() {
  for (int i = 0; i < 10; i++) { pinMode(CATHODE_PINS[i], OUTPUT); digitalWrite(CATHODE_PINS[i], LOW); }
  for (int i = 0; i < BOARD_TUBES; i++) { pinMode(ANODE_PINS[i], OUTPUT); digitalWrite(ANODE_PINS[i], LOW); }
  pinMode(PIN_BUZZER, OUTPUT); digitalWrite(PIN_BUZZER, LOW);

  for (int i = 0; i < BOARD_TUBES; i++) {
    shOld[i] = shNew[i] = BLANK; shFade[i] = 255; pushTube(i); vOnTicks[i] = 0;
  }

  analogSetAttenuation(ADC_11db);
  buildMasks();
  hvPwmSetup();
  hvPwmWrite(0);
  neonPwmSetup();
  neonPwmWrite(0, 0);
  neonPwmWrite(1, 0);
#if BOARD_HAS_LED_BL
  blPwmSetup();
  blPwmWrite(0);
#endif
  muxTimerSetup();

  xTaskCreatePinnedToCore(hvTask,   "hv",   3072, nullptr, 3, nullptr, 0);
  xTaskCreatePinnedToCore(fadeTask, "fade", 2048, nullptr, 2, nullptr, 1);
}

void display_setDigits(const uint8_t digits[BOARD_TUBES], uint16_t fadeMs) {
  bool changed = false;
  for (int i = 0; i < BOARD_TUBES; i++) {
    if (shNew[i] == digits[i] && shOld[i] == digits[i]) continue;
    shOld[i]  = fadeMs ? shNew[i] : digits[i];
    shNew[i]  = digits[i];
    shFade[i] = fadeMs ? 0 : 255;
    pushTube(i);
    changed = true;
  }
  if (!changed) return;
  if (fadeMs) { fadeStartMs = millis(); fadeDurMs = fadeMs; }
  else        { fadeDurMs = 0; }
}

void display_setColon(ColonMode mode) { colonMode = mode; }

void display_setBrightness(uint8_t percent) {
  effBright = percent;
  // Perceptual gamma, then the per-tube trim. The trim matters most on the
  // electroNIX 2, where the small seconds tubes run through 6.2 k emitter
  // resistors against 2 k for the large ones.
  uint16_t g = ((uint16_t)percent * percent) / 100;
  for (int i = 0; i < BOARD_TUBES; i++) {
    uint16_t v = ((uint16_t)ACTIVE_TICKS * g) / 100;
    v = (v * cfg.trim[i]) / 100;
    if (percent > 0 && v == 0) v = 1;
    vOnTicks[i] = (uint8_t)v;
  }
  hvEnable = (percent > 0);

#if BOARD_HAS_LED_BL
  uint8_t lb = (!cfg.ledEn || percent == 0) ? 0 : cfg.ledBr;
  if (cfg.ledNight && percent > 0 && percent <= cfg.nightBr)
    lb = (cfg.nightBr == 0) ? 0 : (lb * cfg.nightBr) / 100;
  blPwmWrite((uint32_t)lb * lb * 255 / 10000);        // gamma on the LEDs too
#endif
}

void display_tick_100ms() {
  lightMv += 0.02f * (readLight() - lightMv);          // tau ~5 s
  // Re-apply the wiring order if the user changed it. Cheap comparison; the
  // masks are only rebuilt when something actually differs.
  static uint8_t lastCath[10], lastAnode[BOARD_TUBES];
  static bool first = true;
  if (first || memcmp(lastCath, cfg.cathOrder, 10) ||
      memcmp(lastAnode, cfg.anodeOrder, BOARD_TUBES)) {
    memcpy(lastCath, cfg.cathOrder, 10);
    memcpy(lastAnode, cfg.anodeOrder, BOARD_TUBES);
    if (!first) buildMasks();
    first = false;
  }
}

static uint16_t muxHealth = 100, muxMin = 100;
void display_tick_1s() {
  uint32_t t = muxTicks; muxTicks = 0;
  uint32_t expect = 1000000UL / TICK_US;
  muxHealth = (uint16_t)((t * 100 + expect / 2) / expect);
  if (muxHealth < muxMin) muxMin = muxHealth;
}

void display_park(bool parked) {
  muxHold = parked;
  if (parked) {
    hvEnable = false;
    hvPwmWrite(0);
    neonPwmWrite(0, 0);
    neonPwmWrite(1, 0);
#if BOARD_HAS_LED_BL
    blPwmWrite(0);
#endif
  } else {
    isrCurCath = 255;
  }
}

void display_snapshot(char *out, int n) {
  int m = BOARD_TUBES < n - 1 ? BOARD_TUBES : n - 1;
  for (int i = 0; i < m; i++) out[i] = (shNew[i] <= 9) ? ('0' + shNew[i]) : ' ';
  out[m] = 0;
}

void display_getStatus(DisplayStatus &s) {
  s.hv        = hvVolts;
  s.duty      = hvDutyPct;
  s.hvFault   = hvFault;
  s.hvCuts    = hvCuts;
  s.muxHealth = muxHealth;
  s.muxMin    = muxMin;
  s.colon0    = colon0On;
  s.colon1    = colon1On;
  s.hasLight  = true;
  s.lightMv   = lightMv;
  s.lightPP   = lightPP;
}

#endif // TESTA boards